### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import csv
import os

In [2]:
file_to_load = "../Pandas_HW/purchase_data.csv"

data = pd.read_csv(file_to_load)
data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

## Player Count

* Display the total number of players

In [4]:
total_players = data['SN'].nunique()
total_players

576

In [5]:
total_players_df = pd.DataFrame([{"Total Players": total_players}])
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [6]:
total_unique = len(data['Item ID'].unique())
total_unique

183

In [7]:
AvPrice = round(data['Price'].mean(),2)
AvPrice

3.05

In [8]:
Number_Purchases = data['Purchase ID'].count()
Number_Purchases

780

In [9]:
Total_Revenue = data['Price'].sum()
Total_Revenue

2379.77

In [10]:
Summary_PA = pd.DataFrame([{"Number of Unique Items": total_unique, "Average Price": AvPrice, "Number of Purchases": Number_Purchases, "Total Revenue" : Total_Revenue}])
Summary_PA

   Average Price  Number of Purchases  Number of Unique Items  Total Revenue
0           3.05                  780                     183        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
count_df = data.groupby(["SN","Gender"]).count().reset_index()
count_df = count_df[["SN", "Gender"]]
count_df = count_df.drop_duplicates(subset=["SN"])
count_df.head()

             SN  Gender
0  Adairialis76    Male
1   Adastirin33  Female
2        Aeda94    Male
3        Aela59    Male
4     Aelaria33    Male

In [12]:
percent_genders = count_df.groupby(['Gender']).count()
percent_genders["Percentage of Players"] = ((percent_genders["SN"] * 100)/total_players)
percent_genders

                        SN  Percentage of Players
Gender
Female                  81              14.062500
Male                   484              84.027778
Other / Non-Disclosed   11               1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
analysis_gender = pd.DataFrame(data.groupby('Gender')['Item ID'].count())

avg_price = data.groupby('Gender')['Price'].mean()
total_purch_value = data.groupby('Gender')['Price'].sum()
avg_total_purch = (total_purch_value)/percent_genders

analysis_gender['Average Purchase Price'] = data.groupby('Gender')['Price'].mean()
analysis_gender['Total Purchase Value'] = data.groupby('Gender')['Price'].sum()
analysis_gender['Avg Total Purchase per Person'] = data.groupby('Gender')['Price'].sum()/percent_genders['SN']
analysis_gender

analysis_gender = analysis_gender.rename(columns={'Item ID': 'Purchase Count'})

analysis_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [14]:
bins = [0, 10, 15, 20, 25, 30, 35, 39, 40]
bin_names = ["0-10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
age_df = data.drop_duplicates(subset ="SN")
age_df = pd.cut(age_df["Age"], bins, labels=bin_names)
age_df = age_df.value_counts()

age_percent = age_df/total_players


Summary_Age_df = pd.DataFrame({"Total Count": age_df,"Percentage of Players":age_percent})
Summary_Age_df = Summary_Age_df.sort_index()

Summary_Age_df

       Total Count  Percentage of Players
0-10            24               0.041667
10-14           41               0.071181
15-19          150               0.260417
20-24          232               0.402778
25-29           59               0.102431
30-34           37               0.064236
35-39           21               0.036458
40+              5               0.008681

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
bins = [0, 10, 15, 20, 25, 30, 35, 39, 40]
bin_names = ["0-10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
data['group'] = pd.cut(data['Age'], bins, labels=bin_names)

purchasing_analysis_df = pd.DataFrame()
grouped_purchases_age = data.groupby('group')

purchasing_analysis_df['Purchase Count'] = grouped_purchases_age['Purchase ID'].size()
purchasing_analysis_df['Average Purchase Price'] = (grouped_purchases_age['Price'].mean()).map("${:.2f}".format)
purchasing_analysis_df['Total Purchase Value'] = (grouped_purchases_age['Price'].sum()).map("${:,.2f}".format)


avg_total_purchase = data.groupby(['group', 'SN'])['Price'].sum().reset_index()
purchasing_analysis_df['Avg Total Purchase per Person'] = (avg_total_purchase.groupby('group')['Price'].mean()).map("${:.2f}".format)

#I was not able to figure why my numbers dont match the example on gitlab
#I'll follow up next class
purchasing_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
group,,,,
0-10,32,$3.40,$108.96,$4.54
10-14,54,$2.90,$156.60,$3.82
15-19,200,$3.11,$621.56,$4.14
20-24,325,$3.02,$981.64,$4.23
25-29,77,$2.88,$221.42,$3.75
30-34,52,$2.99,$155.71,$4.21
35-39,27,$3.54,$95.64,$4.55
40+,6,$2.79,$16.71,$3.34

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [16]:
top_spend_df = pd.DataFrame()

SN_groups = data.groupby('SN')

top_spend_df['Purchase Count'] = SN_groups['Price'].count()
top_spend_df['Average Purchase Price'] = SN_groups['Price'].mean()
top_spend_df['Total Purchase Value'] = SN_groups['Price'].sum()
top_spend_df = top_spend_df.sort_values(by=["Total Purchase Value"], ascending = False)

top_spend_df['Average Purchase Price'] = SN_groups['Price'].mean().map("${:.2f}".format)
top_spend_df['Total Purchase Value'] = SN_groups['Price'].sum().map("${:.2f}".format)

top_spend_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [17]:
most_popular = pd.DataFrame()

item_grouped = data.groupby(['Item ID', 'Item Name'])

most_popular['Purchase Count'] = item_grouped['Item Name'].count()
most_popular['Item Price'] = item_grouped['Price'].sum() / most_popular['Purchase Count']
most_popular['Total Purchase Value'] = most_popular['Purchase Count'] * most_popular['Item Price']
most_popular = most_popular.sort_values(by='Purchase Count', ascending = False)

most_popular['Item Price']= most_popular['Item Price'].map("${:.2f}".format)
most_popular['Total Purchase Value'] = most_popular['Total Purchase Value'].map("${:.2f}".format)

most_popular.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [18]:
most_profitable = most_popular

most_profitable['Total Purchase Value'] = most_popular['Total Purchase Value'].apply(lambda x: x.replace('$', ''))
most_profitable['Total Purchase Value'] = pd.to_numeric(most_profitable['Total Purchase Value'])
most_profitable = most_profitable.sort_values(by='Total Purchase Value', ascending=False)
most_profitable['Total Purchase Value'] = most_profitable['Total Purchase Value'].map("${:.2f}".format)
most_profitable.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80